ltowarek/esp-opentelemetry-cpp/examples/logs/ostream/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

CONFIG_FREERTOS_HZ=1000

CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

CONFIG_ESP_OPENTELEMETRY_LOGS_ENABLED=y
CONFIG_ESP_OPENTELEMETRY_SERVICE_NAME="logs-ostream-example"

# The compile-time cap the ESP_LOGx wrappers inherit is ESP-IDF's default
# maximum, INFO: DEBUG and VERBOSE are not compiled in, so they reach neither
# the console nor the exporter. capped.cpp lowers it further for its own
# translation unit.
